In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
employ_file= "DP_LIVE_Employdata.csv"
GDP_file="DP_LIVE_GDPdata.csv"

In [3]:
employ_df = pd.read_csv(employ_file)
employ_df = employ_df.loc[employ_df['MEASURE'] == 'PC_WKGPOP'] #removing the measure = THND_PER; keeping only 0-100 perc. rate
employ_df.head()

    LOCATION INDICATOR SUBJECT    MEASURE FREQUENCY  TIME     Value Flag Codes
163      AUS       EMP     MEN  PC_WKGPOP         A  1979  82.10677        NaN
164      AUS       EMP     MEN  PC_WKGPOP         A  1980  82.25813        NaN
165      AUS       EMP     MEN  PC_WKGPOP         A  1981  82.32400        NaN
166      AUS       EMP     MEN  PC_WKGPOP         A  1982  80.50681        NaN
167      AUS       EMP     MEN  PC_WKGPOP         A  1983  76.92610        NaN

In [4]:
GDP_df=pd.read_csv(GDP_file)
GDP_df.head()

  LOCATION INDICATOR SUBJECT  MEASURE FREQUENCY  TIME       Value Flag Codes
0      AUS       GDP     TOT  MLN_USD         A  1960  25036.1668        NaN
1      AUS       GDP     TOT  MLN_USD         A  1961  25326.3822        NaN
2      AUS       GDP     TOT  MLN_USD         A  1962  27913.2057        NaN
3      AUS       GDP     TOT  MLN_USD         A  1963  30385.7232        NaN
4      AUS       GDP     TOT  MLN_USD         A  1964  32695.8783        NaN

In [5]:
GDP_new_df=GDP_df[["LOCATION","INDICATOR","SUBJECT","TIME","Value"]]
GDP_new_df.head()

  LOCATION INDICATOR SUBJECT  TIME       Value
0      AUS       GDP     TOT  1960  25036.1668
1      AUS       GDP     TOT  1961  25326.3822
2      AUS       GDP     TOT  1962  27913.2057
3      AUS       GDP     TOT  1963  30385.7232
4      AUS       GDP     TOT  1964  32695.8783

In [6]:
GDP_new_df = GDP_new_df.rename(columns={"Value":"GDP Value"})
GDP_new_df = GDP_new_df[['LOCATION', 'TIME', 'GDP Value']]
GDP_new_df = GDP_new_df.rename(columns={"LOCATION":"Country","TIME":"Year"})

GDP_new_df.head()

  Country  Year   GDP Value
0     AUS  1960  25036.1668
1     AUS  1961  25326.3822
2     AUS  1962  27913.2057
3     AUS  1963  30385.7232
4     AUS  1964  32695.8783

In [7]:
employ_new_df=employ_df[["LOCATION","INDICATOR","SUBJECT","TIME","Value"]]
employ_new_df=employ_new_df.rename(columns={"LOCATION":"Country","TIME":"Year","Value":"Emp Value"})
employ_new_df.head()

    Country INDICATOR SUBJECT  Year  Emp Value
163     AUS       EMP     MEN  1979   82.10677
164     AUS       EMP     MEN  1980   82.25813
165     AUS       EMP     MEN  1981   82.32400
166     AUS       EMP     MEN  1982   80.50681
167     AUS       EMP     MEN  1983   76.92610

#### Cleaning

In [8]:
# Dropping the values where subject != Total (Men; Women)
# GDP_new_df = GDP_new_df.loc[GDP_new_df['SUBJECT'] == "TOT"]

employ_new_df = employ_new_df.loc[employ_new_df['SUBJECT'] == "TOT"]
employ_new_df.head()

    Country INDICATOR SUBJECT  Year  Emp Value
203     AUS       EMP     TOT  1979   64.38335
204     AUS       EMP     TOT  1980   65.17445
205     AUS       EMP     TOT  1981   65.36742
206     AUS       EMP     TOT  1982   64.16441
207     AUS       EMP     TOT  1983   61.94022

In [9]:
employ_new_df = employ_new_df[['Country', 'Year', 'Emp Value']]

In [10]:
#Employement has 2016-Q2 & 2016-12 data - need to get grouped, averaged out and replaced on yearly basis

employ_new_df['Year'] = pd.to_datetime(employ_new_df['Year']).apply(lambda x : pd.Period(x, freq='M').year)

#employ_new_df.groupby(['LOCATION'], ['TIME']).mean()
#employ_new_df.groupby(['LOCATION','TIME']).reset_index()
#employ_new_df = employ_new_df.groupby(('LOCATION', 'TIME'], as_index=False).agg({"Value": "sum"})

# employ_new_df= employ_new_df.groupby(['LOCATION','TIME'], as_index=False).agg({'Value':'mean'})
employ_new_df.head()

    Country  Year  Emp Value
203     AUS  1979   64.38335
204     AUS  1980   65.17445
205     AUS  1981   65.36742
206     AUS  1982   64.16441
207     AUS  1983   61.94022

In [11]:
employ_new_df = employ_new_df.loc[employ_new_df['Year'] >= 2000]
GDP_new_df = GDP_new_df.loc[GDP_new_df['Year'] >= 2000]

In [12]:
GDP_new_df = GDP_new_df.groupby(['Country', 'Year'], as_index=False).agg({"GDP Value": "mean"})
GDP_new_df.head()

  Country  Year      GDP Value
0     ARG  2004  247418.443175
1     ARG  2005  277710.485069
2     ARG  2006  308920.358148
3     ARG  2007  345624.182414
4     ARG  2008  366612.679462

In [13]:
employ_new_df = employ_new_df.groupby(['Country', 'Year'], as_index=False).agg({"Emp Value": "mean"})
#employ_new_df

In [14]:
#combined = pd.merge(GDP_new_df, employ_new_df, 
#                    how = 'inner', left_on= ['Year', 'Country'], right_on = ['Year', 'Country'])

combined_df= pd.merge(GDP_new_df, employ_new_df, on = ['Year', 'Country'], how='inner')
combined_df.drop_duplicates(keep=False)
combined_df

    Country  Year     GDP Value  Emp Value
0       AUS  2000  2.830109e+05  69.085338
1       AUS  2001  2.985813e+05  69.009075
2       AUS  2002  3.150211e+05  69.332712
3       AUS  2003  3.336445e+05  69.985809
4       AUS  2004  3.546693e+05  70.286239
5       AUS  2005  3.766379e+05  71.520062
6       AUS  2006  4.060950e+05  72.112506
7       AUS  2007  4.323268e+05  72.796190
8       AUS  2008  4.460390e+05  73.184184
9       AUS  2009  4.721421e+05  72.041994
10      AUS  2010  4.930203e+05  72.365039
11      AUS  2011  5.183733e+05  72.654606
12      AUS  2012  5.207033e+05  72.342465
13      AUS  2013  5.761937e+05  71.973170
14      AUS  2014  5.829945e+05  71.527626
15      AUS  2015  5.875318e+05  72.129721
16      AUS  2016  6.330801e+05  72.406922
17      AUS  2017  6.655706e+05  72.971542
18      AUS  2018  7.036821e+05  73.755126
19      AUT  2000  1.323802e+05  68.480132
20      AUT  2001  1.343468e+05  68.386716
21      AUT  2002  1.415814e+05  68.738312
22      AUT  2003  1.464446e+05  68.937604
23      AUT  2004  1.547502e+05  66.506554
24      AUT  2005  1.615556e+05  67.392338
25      AUT  2006  1.743590e+05  68.560448
26      AUT  2007  1.830871e+05  69.877794
27      AUT  2008  1.925645e+05  70.801762
28      AUT  2009  1.911993e+05  70.329818
29      AUT  2010  1.966657e+05  70.777746
..      ...   ...           ...        ...
688     USA  2008  7.380578e+06  70.873802
689     USA  2009  7.247980e+06  67.612791
690     USA  2010  7.520223e+06  66.687134
691     USA  2011  7.796191e+06  66.642722
692     USA  2012  8.124264e+06  67.132111
693     USA  2013  8.418934e+06  67.357072
694     USA  2014  8.788341e+06  68.150311
695     USA  2015  9.137999e+06  68.711219
696     USA  2016  9.382493e+06  69.347681
697     USA  2017  9.772584e+06  70.109760
698     USA  2018  1.027829e+07  70.726574
699     ZAF  2000  1.767920e+05  45.675350
700     ZAF  2001  1.857018e+05  44.084463
701     ZAF  2002  1.953660e+05  42.834460
702     ZAF  2003  2.050873e+05  41.511053
703     ZAF  2004  2.202690e+05  41.589603
704     ZAF  2005  2.392935e+05  43.372973
705     ZAF  2006  2.603994e+05  44.895530
706     ZAF  2007  2.815862e+05  44.427110
707     ZAF  2008  2.961937e+05  45.914884
708     ZAF  2009  2.937746e+05  43.868616
709     ZAF  2010  3.063196e+05  41.836172
710     ZAF  2011  3.228010e+05  41.919572
711     ZAF  2012  3.359560e+05  42.208762
712     ZAF  2013  3.497694e+05  42.727764
713     ZAF  2014  3.625224e+05  42.773890
714     ZAF  2015  3.708984e+05  43.680858
715     ZAF  2016  3.785510e+05  43.034154
716     ZAF  2017  3.897063e+05  43.355976
717     ZAF  2018  7.959031e+05  43.247108

[718 rows x 4 columns]